---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCImportIntent.Parametric
enum: Autodesk.Revit.DB.IFC.IFCImportIntent
source: html/07dbaa65-98da-4403-7c19-c234246584ba.htm
---
# Autodesk.Revit.DB.IFC.IFCImportIntent.Parametric

Imports the IFC file to allow for continued editing in Revit (standard Revit elements will be created).